# Задача №1
# Необходимо расширить функцию переводчика так, чтобы она принимала следующие параметры:
#
# Путь к файлу с текстом;
# Путь к файлу с результатом;
# Язык с которого перевести;
# Язык на который перевести (по-умолчанию русский).
# У вас есть 3 файла (DE.txt, ES.txt, FR.txt) с новостями на 3 языках: французском, испанском, немецком.
# Функция должна взять каждый файл с текстом, перевести его на русский и сохранить результат в новом файле.
#
# Для переводов можно пользоваться API Yandex.Переводчик.
#
# *Задача №2
# Научиться работать с api Яндекс.Диска Написать программу, которая загружает переведенные файлы на Яндекс.Диск.
# Документация по загрузке файлов Токен можно получить на Полигоне кликнув по кнопке "Получить OAuth-токен"
